{
  "title": "Maharana Pratap",
  "url": "https://en.wikipedia.org/wiki/Maharana_Pratap",
  "content": "Pratap Singh I (18 May 1540 – 19 January 1597), popularly known as Maharana Pratap (IPA: [məɦaːˈɾaːɳaː pɾəˈtaːp] ), was king of the Kingdom of Mewar, in north-western India in the present-day state of Rajasthan, from 1572 until his death in 1597. He is notable for leading the Rajput resistance against the expansionist policy of the Mughal Emperor Akbar including the battle of Haldighati.\n\n\n== Early life and accession ==\nMaharana Pratap was born to Udai Singh II of Mewar and Jaiwanta Bai in 1540, the year in which Udai Singh ascended to the throne after defeating Vanvir Singh. His younger brothers were Shakti Singh, Vikram Singh and Jagmal Singh. Pratap also had two stepsisters: Chand Kanwar and Man Kanwar. His chief consort was Ajabde Bai Punwar of Bijolia. Their eldest son was Amar Singh I. He belonged to the royal family of Mewar. After the death of Udai Singh in 1572, Rani Dheer Bai Bhatiyani wanted her son Jagmal to succeed him but senior courtiers preferred Pratap, as the eldest son, to be their king. The desire of the nobles prevailed and Pratap ascended the throne as Maharana Pratap, the 54th ruler of Mewar in the line of the Sisodia Rajputs. He was crowned in Gogunda on the auspicious day of Holi. Jagmal swore revenge and left for Ajmer, to join the armies of Emperor Akbar who later gave him a portion of Sirohi.\n\n\n== Initial conflict with the Mughals ==\n\n\n=== Background ===\nAkbar initially favored diplomacy over direct conflict in his dealings with Maharana Pratap. Although Jagmal, Pratap's rival, sought Akbar’s support and had been named successor by his father, the emperor refrained from military intervention—largely due to ongoing unrest in Gujarat. Instead, Akbar dispatched several emissaries to negotiate with Pratap, including Jalal Khan, Man Singh, Raja Bhagwant das, and Todar Mal. However, all these attempts ended in failure. Pratap consistently resisted submission, either by making ambiguous promises or by declining to meet the envoys altogether. Rajput sources claim that Pratap even insulted Man Singh by avoiding a feast held in his honor, an account many modern historians consider exaggerated. The breakdown of negotiations likely stemmed from Akbar’s demands—such as personal attendance at the Mughal court, payment of tribute, political allegiance, or a matrimonial alliance—all of which were unacceptable to Pratap. By late 1573 A.D., it had become evident that a peaceful resolution was unlikely, and a military confrontation appeared inevitable. \nSome scholars suggest that a key but often overlooked point of contention between Akbar and Maharana Pratap was an elephant named Ram Prasad. Historical sources such as ʽAbd al-Qadir Badayuni and Abul Fazl mention that Akbar had repeatedly requested this elephant from the Rana, but Pratap refused to surrender it. The elephant was eventually captured by the Mughal army during the Battle of Haldighati and brought to Akbar. Badauni even describes Ram Prasad as a subject of dispute. This incident has been interpreted by some historians as further evidence of Pratap’s unwillingness to submit to Mughal authority, casting doubt on claims that he ever sent his son Amar Singh or any proposal to Akbar’s court, as suggested by Abu'l-Fazl.\nThe conflicts between Pratap Singh and Akbar led to the Battle of Haldighati.\nAccording to Indian Journal of Secularism, in his campaign to extend his empire, Akbar presented Rana Pratap with the rank of Panj Hazari (commander of an army of 5,000). Rana Pratap refused, demanding instead the rank of Dah Hazari (commander of an army of 10,000).leading to battle of haldighati.\n\n\n=== Battle of Haldighati ===\n\nThe Siege of Chittorgarh in 1567-1568 had led to the loss of the fertile eastern belt of Mewar to the Mughals. However, the rest of the wooded and hilly kingdom in the Aravalli range was still under the control of Maharana Pratap. Mughal Emperor Akbar was intent on securing a stable route to Gujarat through Mewar; when Pratap Singh was crowned king (Maharana) in 1572, Akbar sent a number of envoys, including one by Raja Man Singh I of Amer, entreating him to become a vassal like many other rulers in Rajputana. When Pratap refused to personally submit to Akbar and several attempts to diplomatically settle the issue failed, war became inevitable.\nThe forces of Pratap Singh and Mughal and Rajput general Man Singh met on 18 June 1576 beyond a narrow mountain pass at Haldighati near Gogunda, modern day Rajsamand in Rajasthan. This came to be known as the battle of Haldighati. Pratap Singh fielded a force of around 3000 cavalry and 400 Bhil archers. Man Singh commanded an army numbering around 10,000 men.  After a fierce battle lasting more than three hours, Pratap found himself wounded and the day lost. He managed to retreat to the hills and lived to fight another day. The Mughals were victorious and inflicted significant casualties among the forces of Mewar but failed to capture Maharana Pratap.\nRana Pratap was able to escape due to selfless devotion of chief of Jhala who drew upon himself the attack of armies by declaring himself to be Rana.\nHaldighati was a futile victory for the Mughals, as they were unable to kill or capture Pratap, or any of his close family members in Udaipur. While the sources also claim that Pratap was able to make a successful escape, Man Singh managed to conquer Gogunda within a week after Haldighati then ended his campaign. Subsequently, Akbar himself led a sustained campaign against the Rana in September 1576, and soon, Gogunda, Udaipur, and Kumbhalgarh were all under Mughal control.\n\n\n=== Post-Haldighati Mughal invasions ===\nShahbaz Khan Kamboh led multiple invasions that resulted in the subjugation of key areas in Mewar, such as Kumbhalgarh, Mandalgarh, Gogunda, and Central Mewar, bringing them permanently under Mughal rule. The Mughal Empire established its supremacy in Mewar after Shahbaz Khan's invasions. This ultimately led to a significant weakening of Pratap's power, forcing him to seek shelter in his hilly abode.\n\n\n== Patronage of art ==\nMaharana Pratap's court at Chavand provided refuge to numerous poets, artists, writers, and artisans. During his reign, the Chavand school of art emerged and developed as a distinctive artistic tradition. His support for cultural activities is evidenced by the presence of notable figures such as the artist Nasiruddin in his court.\n\n\n== Reconquest of Mewar ==\n\nMughal pressure on Mewar relaxed after 1579 following rebellions in Bengal and Bihar and Mirza Hakim's incursion into the Punjab. After this Akbar sent Jagannath Kachhwaha to invade Mewar in 1584. This time too Mewar army defeated Mughals and forced them to retreat. In 1585, Akbar moved to Lahore and remained there for the next twelve years watching the situation in the north-west. No major Mughal expedition was sent to Mewar during this period. Taking advantage of the situation, Pratap recovered some of the Mughal occupied areas of Mewar and captured thirty-six Mughal outposts. Udaipur, Mohi, Gogunda, Mandal and Pandwara were some of the important areas that were recaptured during this conflict. According to the 1588 inscription near Jahazpur, the Rana gave the lands of Pander to a trusted follower called Sadulnath Trivedi. G.N. Sharma claims that the Pander inscription is proof that the Rana had occupied north-eastern Mewar and was granting lands to those who had been loyal to him. From 1585 till his death, the Rana had recovered a large part of Mewar. The citizens who had migrated out of Mewar started returning during this time. There was good monsoon which helped to revive the agriculture of Mewar. The economy also started getting better and trade in the area started increasing. The Rana was able to capture the territories around Chittor but could not fulfill his dream of capturing Chittor itself.\n\n\n== Death ==\nMaharana Pratap reportedly died from injuries sustained in a hunting accident at Chavand on 19 January 1597, at the age of 56. He was succeeded by his eldest son, Amar Singh I. On his deathbed, Pratap is said to have instructed his son never to submit to the Mughals and to make efforts to reclaim Chittor.\nAccording to some accounts, the Mughal emperor Akbar was deeply affected upon hearing the news of Maharana Pratap's death. The court poet Dursa Arha is said to have eulogised Pratap in the Mughal court as a mark of respect.\n\n\n== Legacy ==\n\nMaharana Pratap is a prominent figure in both folk and contemporary Rajasthani culture and is viewed as a folk hero and celebrated warrior in that state, as well as in India as a whole.\nHistorian Satish Chandra notes –\n\n\"Rana Pratap's defiance of the mighty Mughal empire, almost alone and unaided by the other Rajput states, constitute a glorious saga of Rajput valour and the spirit of self sacrifice for cherished principles. Rana Pratap's methods of guerrilla warfare was later elaborated further by Malik Ambar, the Deccani general, and by Shivaji\".\nBandyopadhyay also seconds Satish Chandra's view with the observation that \n\nPratap's successful defiance of Mughals using guerrilla strategy also proved inspirational to figures ranging from Shivaji to anti-British revolutionaries in Bengal.\nIn 2007, a statue of Maharana Pratap was unveiled by former President Pratibha Patil in the Parliament of India.\n\n\n== In popular culture ==\n\n\n=== Film and television ===\n1988–1989: Bharat Ek Khoj, broadcast on Doordarshan, where he was played by Puneet Issar\n2012: Maharana Pratap: The First Freedom Fighter\n2013–2015: Jodha Akbar, broadcast on Zee TV, where he was played by Anurag Sharma\n2013–2015: Bharat Ka Veer Putra – Maharana Pratap, broadcast by Sony Entertainment Television (India), where he was portrayed by Faisal Khan and Sharad Malhotra\n2016: ABP News presented Bharatvarsha, in which episode 8 showcased the story of Maharana Pratap.\n2023: Deepraj Rana as Maharana Pratap in Webseries Taj: Divided by Blood on Zee5\n\n\n== See also ==\n\nUdaipur State\nDurgadas Rathore\n\n\n== References ==\n\n\n== Sources ==\nSarkar, Jadunath (1960). Military History of India. Orient Longmans. pp. 75–81. ISBN 9780861251551. {{cite book}}: ISBN / Date incompatibility (help)\nChandra, Satish (2005). Medieval India (Part Two): From Sultanat to the Mughals. Har-Anand Publications. ISBN 9788124110669.\nRana, Bhawan Singh (2004), Maharana Pratap, Diamond Pocket Books, ISBN 9788128808258\nMajumdar, R. C., ed. (1974). History and Culture of the Indian People. Vol. VII. Bombay: Bharatiya Vidya Bhavan.\nAugustus, Frederick (1890). The Emperor Akbar, a contribution towards the history of India in the 16th century (Vol. 1). Translated by Annette Susannah Beveridge. Thacker, Spink and Co., Calcutta.\nde la Garza, Andrew (2016). The Mughal Empire at War: Babur, Akbar and the Indian Military Revolution, 1500–1605. Routledge. ISBN 9781317245315.\nRaghavan, T.C.A. (2018). Attendant Lords: Bairam Khan and Abdur Rahim, Courtiers and Poets in Mughal India. HarperCollins.\nNahar, Vijay (2011). हिंडुआ सूरज मेवाड़ रतन [Hindua Suraj Mewar Ratan] (in Hindi). Jaipur, Rajasthan: Pinkcity Publishers. ISBN 978-93-80522-45-6.\n\n\n== External links ==\n\nOfficial Website for the Royal Family of Udaipur",
  "summary": "Pratap Singh I (18 May 1540 – 19 January 1597), popularly known as Maharana Pratap (IPA: [məɦaːˈɾaːɳaː pɾəˈtaːp] ), was king of the Kingdom of Mewar, in north-western India in the present-day state of Rajasthan, from 1572 until his death in 1597. He is notable for leading the Rajput resistance against the expansionist policy of the Mughal Emperor Akbar including the battle of Haldighati.\n\n",
  "references": [
    "https://books.google.com/books?id=qoRDAAAAYAAJ",
    "https://books.google.com/books?id=K0UnRk-rRa4C",
    "http://www.mewarindia.com/",
    "https://archive.org/details/mughulempire00bhar/page/n6/mode/2up",
    "https://archive.org/stream/emperorakbaraco00buchgoog#page/n8/mode/1up",
    "https://books.google.com/books?id=OGERDAAAQBAJ&pg=PA56",
    "https://books.google.com/books?id=qqd1RAAACAAJ&q=rajasthan%20rima%20hooja",
    "https://books.google.com/books?id=3twgPwAACAAJ",
    "https://books.google.com/books?id=zExuAAAAMAAJ",
    "https://books.google.com/books?id=cHFuAAAAMAAJ",
    "https://www.slideshare.net/princynavya/medieval-history-of-india-satish-chandra",
    "https://books.google.com/books?id=AEEgEAAAQBAJ&q=rana+pratap+sporadic+warfare&pg=PA1980",
    "https://www.hindustantimes.com/india/maharana-pratap-s-statue-unveiled/story-MLuPzzVCikZmx0KbPc3ZbO.html",
    "https://www.wikidata.org/wiki/Q2722956#identifiers",
    "https://isni.org/isni/0000000078603646",
    "https://viaf.org/viaf/50031019",
    "https://catalogue.bnf.fr/ark:/12148/cb13510601n",
    "https://data.bnf.fr/ark:/12148/cb13510601n",
    "https://d-nb.info/gnd/11923016X",
    "http://kulturnav.org/a6e1df84-7dc1-40eb-8fc7-354b28c82031",
    "https://www.idref.fr/074069799",
    "https://books.google.com/books?id=IPYmvwEACAAJ&q=battle+of+dewair",
    "https://web.archive.org/web/20150626120848/http://m.friendfeed-media.com/6e9ec7f58014456d2d5fd015cc8af9d2974509c0",
    "http://m.friendfeed-media.com/6e9ec7f58014456d2d5fd015cc8af9d2974509c0",
    "https://id.loc.gov/authorities/n81080870",
    "https://web.archive.org/web/20230411051800/https://www.slideshare.net/princynavya/medieval-history-of-india-satish-chandra",
    "https://www.britannica.com/biography/Rana-Pratap-Singh",
    "https://web.archive.org/web/20180616003537/https://www.britannica.com/biography/Rana-Pratap-Singh",
    "https://books.google.com/books?id=7sQBAAAAMAAJ&q=thirtysix",
    "https://books.google.com/books?id=0Rm9MC4DDrcC",
    "https://web.archive.org/web/20170412063214/https://books.google.co.uk/books?id=BkBh1Nl4dHwC&pg=PA286",
    "https://books.google.com/books?id=BkBh1Nl4dHwC&pg=PA286",
    "https://www.news18.com/news/india/maharana-pratap-jayanti-know-the-real-life-story-of-the-brave-rajput-warrior-2174403.html",
    "https://id.oclc.org/worldcat/entity/E39PBJkhP7TfFTpXTjqvc3X8G3",
    "http://archive.org/details/in.gov.ignca.10571",
    "http://archive.org/details/in.ernet.dli.2015.539416",
    "https://archive.org/details/mughulempire00bhar/page/335/mode/1up?view=theater",
    "https://books.google.com/books?id=43GVAwAAQBAJ&pg=PA49",
    "https://books.google.com/books?id=m3DjCgAAQBAJ&pg=PA157",
    "https://id.worldcat.org/fast/1842131",
    "https://books.google.com/books?id=NcIBAAAAMAAJ",
    "https://books.google.com/books?id=jIs9AAAAMAAJ",
    "https://search.worldcat.org/oclc/2929852",
    "https://books.google.com/books?id=cAVuAAAAMAAJ",
    "https://lux.collections.yale.edu/view/person/d36c1452-75a8-4f32-ab31-a214b50fe12e"
  ],
  "categories": [
    "1540 births",
    "1597 deaths",
    "16th-century Indian monarchs",
    "All Wikipedia articles written in Indian English",
    "All accuracy disputes",
    "All articles with self-published sources",
    "Articles with disputed statements from June 2025",
    "Articles with hatnote templates targeting a nonexistent page",
    "Articles with self-published sources from June 2025",
    "Articles with short description",
    "CS1 Hindi-language sources (hi)",
    "CS1 errors: ISBN date",
    "Hindu monarchs",
    "Hunting accident deaths",
    "Indian Hindus",
    "Maharana Pratap",
    "Monarchs of Mewar",
    "Pages including recorded pronunciations",
    "Pages using Sister project links with hidden wikidata",
    "Pages using the Phonos extension",
    "Pages with Hindi IPA",
    "Rajput monarchs",
    "Short description is different from Wikidata",
    "Use Indian English from October 2023",
    "Use dmy dates from October 2023",
    "Wikipedia extended-confirmed-protected pages"
  ],
  "links": [
    "ABP News",
    "Abul Fazl",
    "Achabal Gardens",
    "Agra Fort",
    "Agra Subah",
    "Ahar Cenotaphs",
    "Ahar River",
    "Ahmad Shah Bahadur",
    "Ahmedabad–Udaipur line",
    "Ahom–Mughal conflicts",
    "Ajabde",
    "Ajmer",
    "Ajmer Subah",
    "Akbar",
    "Akbar's conquest of Gujarat",
    "Akbar II",
    "Alamgir II",
    "Alamgir Mosque, Aurangabad",
    "Amar Singh I",
    "Amar Singh II",
    "Ambamata Temple",
    "Ambika Mata Temple",
    "Ambrai Ghat",
    "Amer, India",
    "Ananya Express",
    "Anurag Sharma (actor)",
    "Aravalli Range",
    "Ari Singh II",
    "Army of the Mughal Empire",
    "Arvind Singh Mewar",
    "Aurangzeb",
    "Awadh Subah",
    "Babur",
    "Badshahi Mosque",
    "Bagore-ki-Haveli",
    "Bahadur Shah I",
    "Bahadur Shah Zafar",
    "Bajirao I",
    "Baro-Bhuyan",
    "Battle of Agra",
    "Battle of Badli-ki-Serai",
    "Battle of Bhuchar Mori",
    "Battle of Buxar",
    "Battle of Chanderi",
    "Battle of Chausa",
    "Battle of Ghaghra",
    "Battle of Haldighati",
    "Battle of Karnal",
    "Battle of Khajwa",
    "Battle of Khanwa",
    "Battle of Najafgarh",
    "Battle of Plassey",
    "Battle of Raj Mahal",
    "Battle of Samugarh",
    "Battle of Sirhind (1555)",
    "Battle of Thanesar (1567)",
    "Battle of Thanesar (1710)",
    "Battle of Tukaroi",
    "Bavji Chatur Singhji",
    "Bayazid of Sylhet",
    "Bengal",
    "Bengal Subah",
    "Bengal war",
    "Berar Subah",
    "Bhagwant Singh of Mewar",
    "Bhamashah",
    "Bharat Ek Khoj",
    "Bharat Ka Veer Putra – Maharana Pratap",
    "Bharatiya Lok Kala Mandal",
    "Bharatvarsh (TV series)",
    "Bhim Singh of Mewar",
    "Bhupal Noble's College",
    "Bhupal Singh",
    "Bibi Ka Maqbara",
    "Bihar",
    "Bihar Subah",
    "Bijolia",
    "Bohra Ganesh Temple",
    "Carnatic state",
    "Carnatic wars",
    "Central Academy Senior Secondary School",
    "Chandpole (Udaipur)",
    "Chavand, Rajasthan",
    "Chawk Mosque, Dhaka",
    "Chetak Circle",
    "Chetak Express",
    "Child's war",
    "Chittor Fort",
    "City Palace, Udaipur",
    "College of Technology & Engineering, Udaipur",
    "Conquest of Bakla",
    "Conquest of Bhulua",
    "Coronation",
    "Daal Baati",
    "Deepraj Rana",
    "Delhi Subah",
    "Devigarh",
    "Doodh Talai Lake",
    "Doordarshan",
    "Durbar Hall",
    "Durgadas Rathore",
    "Dursa Arha",
    "Dynasty",
    "Economy of the Mughal Empire",
    "Eklingji",
    "Emigration of Iranians to India during the 16-18th centuries",
    "FMS Udaipur",
    "Faisal Khan (actor)",
    "Farrukhsiyar",
    "Fateh Sagar Lake",
    "Fateh Singh of Udaipur and Mewar",
    "Fatehpur Sikri",
    "First Battle of Panipat",
    "Flag of the Mughal Empire",
    "Flags of the Mughal Empire",
    "Foreign relations of the Mughal Empire",
    "Gandhi Ground",
    "Gangaur",
    "Gangaur Ghat",
    "Gardens of Babur",
    "Geetanjali Institute of Pharmacy",
    "Geetanjali Medical College",
    "Gogunda",
    "Gokula",
    "Golden Quadrilateral",
    "Government of the Mughal Empire",
    "Gujarat",
    "Gujarat Subah",
    "Gulab Bagh and Zoo",
    "Gupteshwar Mahadev, Udaipur",
    "Guru Gobind Singh",
    "Hadi Rani",
    "Haldighati",
    "Hamir Singh II",
    "Hammir Singh",
    "Hathipole (Udaipur)",
    "Hector Munro, 8th laird of Novar",
    "Hemu",
    "Henry Every",
    "Hindi",
    "Hinduism",
    "Hiran magri",
    "History of Udaipur",
    "Holi",
    "Humayun",
    "Humayun's Tomb",
    "Hyderabad State",
    "Hyderabad Subah",
    "ISBN (identifier)",
    "Ibrahim Lodi",
    "India",
    "Indian Institute of Management (Udaipur)",
    "Indian Rebellion of 1857",
    "Indo-Persian culture",
    "Isa Khan",
    "Islamic art",
    "Issue (genealogy)",
    "Jadunath Sarkar",
    "Jag Mandir",
    "Jagannath Kachhawa invasion of Mewar",
    "Jagat Singh I",
    "Jagat Singh II",
    "Jagdish Temple, Udaipur",
    "Jagmal Singh",
    "Jahandar Shah",
    "Jahangir",
    "Jahangir Mahal, Orchha",
    "Jahazpur",
    "Jai Singh of Mewar",
    "Jaipur",
    "Jaiwanta Bai",
    "Jama Masjid, Delhi",
    "Janardan Rai Nagar Rajasthan Vidyapeeth University",
    "Jat people",
    "Jawan Singh",
    "Jodha Akbar (TV serial)",
    "Karan Singh II",
    "Karni Mata, Udaipur",
    "Khajuraho - Udaipur City Express",
    "Khan Khana invasion of Mewar",
    "Khushal Khattak",
    "Khwaja Usman",
    "Kingdom of Mewar",
    "Kingdom of Mysore",
    "Kshetra Singh",
    "Kumbha of Mewar",
    "Kumbhalgarh",
    "Kumbhalgarh Wildlife Sanctuary",
    "Kumbhalmer",
    "Lachit Borphukan",
    "Lahore",
    "Lahore Fort",
    "Lahore Subah",
    "Lake Badi",
    "Lake Palace",
    "Lake Pichola",
    "Lakha Singh",
    "Lalbagh Fort",
    "List of Ranas of Mewar",
    "List of schools in Udaipur, Rajasthan",
    "List of tombs of Mughal Empire",
    "Luv Kush Indoor Stadium",
    "Maharaja Express",
    "Maharana",
    "Maharana Bhupal Stadium",
    "Maharana Mewar Public School",
    "Maharana Pratap: The First Freedom Fighter",
    "Maharana Pratap Airport",
    "Maharana Pratap Khel Gaon",
    "Maharana Pratap University of Agriculture and Technology",
    "Mahendra Singh Mewar",
    "Mahmud Shah Bahadur",
    "Makar Sankranti",
    "Malik Ambar",
    "Malwa Subah",
    "Man Singh",
    "Man Singh I",
    "Man Singh Jhala",
    "Mandalgarh",
    "Maratha Empire",
    "Marwari language",
    "Mewar",
    "Mewar Express",
    "Mewari language",
    "Mirza Muhammad Hakim",
    "Mohanlal Sukhadia University",
    "Mokal of Mewar",
    "Monsoon Palace",
    "Moti Magri",
    "Mughal-Rajput wars",
    "Mughal Emperor",
    "Mughal Empire",
    "Mughal architecture",
    "Mughal artillery",
    "Mughal clothing",
    "Mughal conquest of Malwa",
    "Mughal emperors",
    "Mughal garden",
    "Mughal painting",
    "Mughal tribe",
    "Mughal weapons",
    "Mughals",
    "Mughal–Maratha wars",
    "Mughal–Portuguese conflicts",
    "Mughal–Safavid war (1622–1623)",
    "Mughal–Safavid war (1649–1653)",
    "Mughlai cuisine",
    "Muhammad Azam Shah",
    "Muhammad Shah",
    "Musa Khan of Bengal",
    "Nader Shah",
    "Nandeshwar Lake",
    "National Highway 76 (India, old numbering)",
    "Nawab of Awadh",
    "Nawabs of Bengal and Murshidabad",
    "Neemach Mata Temple",
    "North–South and East–West Corridor",
    "OCLC (identifier)",
    "Pacific Medical College and Hospital, Udaipur",
    "Pacific University Udaipur",
    "Pala Ganesh Temple",
    "Palace on Wheels",
    "Parliament of India",
    "Persian language in South Asia",
    "Phool Bai Rathore",
    "Pratap Gaurav Kendra",
    "Pratap Park",
    "Pratap Singh (disambiguation)",
    "Pratap Singh II",
    "Pratapaditya",
    "Pratibha Patil",
    "Primogeniture",
    "Puneet Issar",
    "Punjab, India",
    "R. C. Majumdar",
    "Rabindranath Tagore Medical College",
    "Rafi ud-Darajat",
    "Raj Singh I",
    "Raj Singh II",
    "Raja Man Singh",
    "Raja Ravi Varma",
    "Rajasthan",
    "Rajasthani Cuisine",
    "Rajasthani culture",
    "Rajasthani language",
    "Rajput",
    "Rajput confederacy",
    "Rajputana",
    "Rajsamand",
    "Rajsamand District",
    "Rana Pratap Nagar railway station",
    "Rana Raimal",
    "Rana Sanga",
    "Rang Sagar Lake",
    "Ratan Singh II",
    "Rathasena Mata Temple",
    "Red Fort",
    "Rohilkhand",
    "Royal Rajasthan on Wheels",
    "Saheliyon-ki-Bari",
    "Sajjan Singh of Udaipur",
    "Sajjangarh Biological Park",
    "Sangram Singh II",
    "Sardar Singh of Udaipur",
    "Satish Chandra (historian)",
    "Second Battle of Panipat",
    "Shah Alam II",
    "Shah Jahan",
    "Shah Jahan II",
    "Shah Jahan III",
    "Shah Jahan Mosque, Thatta",
    "Shahbaz Khan Kamboh",
    "Shahi Bridge, Jaunpur",
    "Shahryar Mirza",
    "Shakti Singh (16th century Indian noble)",
    "Shalimar Gardens, Lahore",
    "Shambhu Singh",
    "Sharad Malhotra",
    "Sheesh Mahal (Lahore Fort)",
    "Sher Shah Suri",
    "Shilpgram, Udaipur",
    "Shiv Niwas Palace",
    "Shivaji",
    "Shrinathji",
    "Siege of Bijapur",
    "Siege of Chittorgarh (1567–1568)",
    "Siege of Daman (1638–1639)",
    "Siege of Daulatabad",
    "Siege of Delhi",
    "Siege of Golconda",
    "Siege of Hooghly",
    "Siege of Jinji",
    "Siege of Kandahar (1605–1606)",
    "Siege of Mankot (1557)",
    "Siege of Purandhar",
    "Siege of Ranthambore (1568)",
    "Siege of Sambhal",
    "Sikh Empire",
    "Sir John Child, 1st Baronet",
    "Sir Padampat Singhania University",
    "Sira Subah",
    "Sirohi state",
    "Sisodia Dynasty",
    "Sisodia dynasty",
    "Sony Entertainment Television (India)",
    "St. Anthony's Senior Secondary School, Udaipur",
    "Subah",
    "Subah of Multan",
    "Sukhadia Circle",
    "Sunehri Masjid, Lahore",
    "Sur Empire",
    "Surajpole (Udaipur)",
    "Swaroop Sagar Lake",
    "Swarup Singh of Udaipur",
    "Taj: Divided by Blood",
    "Taj Mahal",
    "Teej",
    "Third Battle of Panipat",
    "Tibet–Ladakh–Mughal war",
    "Timurid dynasty",
    "Timurid family tree",
    "Todar Mal",
    "Tomb of Akbar the Great",
    "Tomb of Aurangzeb",
    "Tomb of Jahangir",
    "Tomb of Nur Jahan",
    "Tomb of Salim Chishti",
    "Tourist attractions in Udaipur",
    "Udai Singh I",
    "Udai Singh II",
    "Udaipole",
    "Udaipur",
    "Udaipur (Lok Sabha constituency)",
    "Udaipur Chamber of Commerce and Industry",
    "Udaipur City's Five lakes",
    "Udaipur City - Haridwar Express",
    "Udaipur City Bus Depot",
    "Udaipur City railway station",
    "Udaipur City–Jaipur Intercity Express",
    "Udaipur District",
    "Udaipur International Cricket Stadium",
    "Udaipur Municipal Corporation",
    "Udaipur Solar Observatory",
    "Udaipur State",
    "Udaipur division",
    "Udaisagar Lake",
    "University of Michigan",
    "Vanvir Singh",
    "Vanvir singh",
    "Veer Bhumi Chittaurgarh Express",
    "Vijay Nahar",
    "Vikramaditya Singh (Maharana)",
    "Vintage and Classic Car Museum",
    "Wazir Khan Mosque",
    "West Zone Cultural Centre",
    "Zee TV",
    "ʽAbd al-Qadir Badayuni"
  ],
  "images": [
    "https://upload.wikimedia.org/wikipedia/commons/6/67/Aum_Om_red.svg",
    "https://upload.wikimedia.org/wikipedia/commons/d/d1/Flag_of_the_Mughal_Empire_%28triangular%29.svg",
    "https://upload.wikimedia.org/wikipedia/commons/6/6e/Imperial_Crown_Heraldry.svg",
    "https://upload.wikimedia.org/wikipedia/commons/a/a8/Maharana_Pratap.ogg",
    "https://upload.wikimedia.org/wikipedia/commons/5/59/Maharana_Pratap_By_Surendra_Singh_Shaktawat.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/4d/Mewar.svg",
    "https://upload.wikimedia.org/wikipedia/commons/4/48/P_history.svg",
    "https://upload.wikimedia.org/wikipedia/commons/0/08/Statue_of_Maharana_Pratap_of_Mewar%2C_commemorating_the_Battle_of_Haldighati%2C_City_Palace%2C_Udaipur.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/f/ff/Wikidata-logo.svg",
    "https://upload.wikimedia.org/wikipedia/commons/f/fa/Wikiquote-logo.svg",
    "https://upload.wikimedia.org/wikipedia/en/4/4a/Commons-logo.svg",
    "https://upload.wikimedia.org/wikipedia/en/8/8c/Extended-protection-shackle.svg",
    "https://upload.wikimedia.org/wikipedia/en/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg"
  ],
  "timestamp": "2025-10-10T10:16:54.231235"
}